galiman/uKOS/OS_Kernel-III/Ports/EquatesModels/SOCs/STM32F746/cpu_reg/stm32F746_rcc.h
#define	RCC_CIR_LSIRDYF 			0x00000001	//
#define	RCC_CIR_LSERDYF 			0x00000002	//
#define	RCC_CIR_HSIRDYF 			0x00000004	//
#define	RCC_CIR_HSERDYF 			0x00000008	//
#define	RCC_CIR_PLLRDYF 			0x00000010	//
#define	RCC_CIR_PLLI2SRDYF			0x00000020	//
#define	RCC_CIR_PLLSAIRDYF			0x00000040	//
#define	RCC_CIR_CSSF				0x00000080	//
#define	RCC_CIR_LSIRDYIE			0x00000100	//
#define	RCC_CIR_LSERDYIE			0x00000200	//
#define	RCC_CIR_HSIRDYIE			0x00000400	//
#define	RCC_CIR_HSERDYIE			0x00000800	//
#define	RCC_CIR_PLLRDYIE			0x00001000	//
#define	RCC_CIR_PLLI2SRDYIE   		0x00002000	//
#define	RCC_CIR_PLLSAIRDYIE   		0x00004000	//
#define	RCC_CIR_LSIRDYC 			0x00010000	//
#define	RCC_CIR_LSERDYC 			0x00020000	//
#define	RCC_CIR_HSIRDYC 			0x00040000	//
#define	RCC_CIR_HSERDYC 			0x00080000	//
#define	RCC_CIR_PLLRDYC 			0x00100000	//
#define	RCC_CIR_PLLI2SRDYC			0x00200000	//
#define	RCC_CIR_PLLSAIRDYC			0x00400000	//
#define	RCC_CIR_CSSC				0x00800000	//

// RCC_AHB1RSTR register

#define	RCC_AHB1RSTR_GPIOARST 		0x00000001	//
#define	RCC_AHB1RSTR_GPIOBRST 		0x00000002	//
#define	RCC_AHB1RSTR_GPIOCRST 		0x00000004	//
#define	RCC_AHB1RSTR_GPIODRST 		0x00000008	//
#define	RCC_AHB1RSTR_GPIOERST 		0x00000010	//
#define	RCC_AHB1RSTR_GPIOFRST 		0x00000020	//
#define	RCC_AHB1RSTR_GPIOGRST 		0x00000040	//
#define	RCC_AHB1RSTR_GPIOHRST 		0x00000080	//
#define	RCC_AHB1RSTR_GPIOIRST 		0x00000100	//
#define	RCC_AHB1RSTR_GPIOJRST 		0x00000200	//
#define	RCC_AHB1RSTR_GPIOKRST 		0x00000400	//
#define	RCC_AHB1RSTR_CRCRST   		0x00001000	//
#define	RCC_AHB1RSTR_DMA1RST  		0x00200000	//
#define	RCC_AHB1RSTR_DMA2RST  		0x00400000	//
#define	RCC_AHB1RSTR_DMA2RST  		0x00400000	//
#define	RCC_AHB1RSTR_DMA2DRST		0x00800000	//
#define	RCC_AHB1RSTR_ETHMACRST		0x02000000	//
#define	RCC_AHB1RSTR_OTGHRST  		0x10000000	//

// RCC_AHB2RSTR register

#define	RCC_AHB2RSTR_DCMIRST  		0x00000001	//
#define	RCC_AHB2RSTR_RNGRST   		0x00000040	//
#define	RCC_AHB2RSTR_OTGFSRST 		0x00000080	//

// RCC_AHB3RSTR register

#define	RCC_AHB3RSTR_FSMCRST  		0x00000001	//
#define	RCC_AHB3RSTR_QSPIRST  		0x00000002	//

// RCC_APB1RSTR register

#define	RCC_APB1RSTR_TIM2RST  		0x00000001	//
#define	RCC_APB1RSTR_TIM3RST  		0x00000002	//
#define	RCC_APB1RSTR_TIM4RST  		0x00000004	//
#define	RCC_APB1RSTR_TIM5RST  		0x00000008	//
#define	RCC_APB1RSTR_TIM6RST  		0x00000010	//
#define	RCC_APB1RSTR_TIM7RST  		0x00000020	//
#define	RCC_APB1RSTR_TIM12RST 		0x00000040	//
#define	RCC_APB1RSTR_TIM13RST 		0x00000080	//
#define	RCC_APB1RSTR_TIM14RST 		0x00000100	//
#define	RCC_APB1RSTR_WWDGEN   		0x00000800	//
#define	RCC_APB1RSTR_SPI2RST  		0x00004000	//
#define	RCC_APB1RSTR_SPI3RST  		0x00008000	//
#define	RCC_APB1RSTR_SPDIFRXRST  	0x00010000	//
#define	RCC_APB1RSTR_USART2RST		0x00020000	//
#define	RCC_APB1RSTR_USART3RST		0x00040000	//
#define	RCC_APB1RSTR_UART4RST 		0x00080000	//
#define	RCC_APB1RSTR_UART5RST 		0x00100000	//
#define	RCC_APB1RSTR_I2C1RST  		0x00200000	//
#define	RCC_APB1RSTR_I2C2RST  		0x00400000	//
#define	RCC_APB1RSTR_I2C3RST  		0x00800000	//
#define	RCC_APB1RSTR_CAN1RST  		0x02000000	//
#define	RCC_APB1RSTR_CAN2RST  		0x04000000	//
#define	RCC_APB1RSTR_PWRRST   		0x10000000	//
#define	RCC_APB1RSTR_DACRST   		0x20000000	//
#define	RCC_APB1RSTR_UART7RST 		0x40000000	//
#define	RCC_APB1RSTR_UART8RST 		0x80000000	//

// RCC_APB2RSTR register

#define	RCC_APB2RSTR_TIM1RST   		0x00000001	//
#define	RCC_APB2RSTR_TIM8RST   		0x00000002	//
#define	RCC_APB2RSTR_USART1RST 		0x00000010	//
#define	RCC_APB2RSTR_USART6RST 		0x00000020	//
#define	RCC_APB2RSTR_ADCRST    		0x00000100	//
#define	RCC_APB2RSTR_SDMMC1RST 		0x00000800	//
#define	RCC_APB2RSTR_SPI1RST   		0x00001000	//
#define	RCC_APB2RSTR_SPI4RST   		0x00002000	//
#define	RCC_APB2RSTR_SYSCFGRST 		0x00004000	//
#define	RCC_APB2RSTR_TIM9RST   		0x00010000	//
#define	RCC_APB2RSTR_TIM10RST  		0x00020000	//
#define	RCC_APB2RSTR_TIM11RST  		0x00040000	//
#define	RCC_APB2RSTR_SPI5RST   		0x00100000	//
#define	RCC_APB2RSTR_SPI6RST   		0x00200000	//
#define	RCC_APB2RSTR_SAI1RST   		0x00400000	//
#define	RCC_APB2RSTR_SAI2RST   		0x00800000	//
#define	RCC_APB2RSTR_LTDCRST   		0x04000000	//

// RCC_AHB1ENR register

#define	RCC_AHB1ENR_GPIOAEN   		0x00000001	//
#define	RCC_AHB1ENR_GPIOBEN   		0x00000002	//
#define	RCC_AHB1ENR_GPIOCEN   		0x00000004	//
#define	RCC_AHB1ENR_GPIODEN   		0x00000008	//
#define	RCC_AHB1ENR_GPIOEEN   		0x00000010	//
#define	RCC_AHB1ENR_GPIOFEN   		0x00000020	//
#define	RCC_AHB1ENR_GPIOGEN   		0x00000040	//
#define	RCC_AHB1ENR_GPIOHEN   		0x00000080	//
#define	RCC_AHB1ENR_GPIOIEN   		0x00000100	//
#define	RCC_AHB1ENR_GPIOJEN   		0x00000200	//
#define	RCC_AHB1ENR_GPIOKEN   		0x00000400	//
#define	RCC_AHB1ENR_CRCEN 			0x00001000	//
#define	RCC_AHB1ENR_BKPSRAMEN 		0x00040000	//
#define	RCC_AHB1ENR_CCMDATARAMEN	0x00100000	//
#define	RCC_AHB1ENR_DMA1EN			0x00200000	//
#define	RCC_AHB1ENR_DMA2EN			0x00400000	//
#define	RCC_AHB1ENR_DMA2DEN			0x00800000	//
#define	RCC_AHB1ENR_ETHMACEN  		0x02000000	//
#define	RCC_AHB1ENR_ETHMACTXEN		0x04000000	//
#define	RCC_AHB1ENR_ETHMACRXEN		0x08000000	//
#define	RCC_AHB1ENR_ETHMACPTPEN		0x10000000	//
#define	RCC_AHB1ENR_OTGHSEN   		0x20000000	//
#define	RCC_AHB1ENR_OTGHSULPIEN		0x40000000	//

// RCC_AHB2ENR register

#define	RCC_AHB2ENR_DCMIEN			0x00000001	//
#define	RCC_AHB2ENR_RNGEN 			0x00000040	//
#define	RCC_AHB2ENR_OTGFSEN   		0x00000080	//

// RCC_AHB3ENR register

#define	RCC_AHB3ENR_FSMCEN			0x00000001	//
#define	RCC_AHB3ENR_QSPIEN			0x00000002	//

// RCC_APB1ENR register

#define	RCC_APB1ENR_TIM2EN   		0x00000001	//
#define	RCC_APB1ENR_TIM3EN   		0x00000002	//
#define	RCC_APB1ENR_TIM4EN   		0x00000004	//
#define	RCC_APB1ENR_TIM5EN   		0x00000008	//
#define	RCC_APB1ENR_TIM6EN   		0x00000010	//
#define	RCC_APB1ENR_TIM7EN   		0x00000020	//
#define	RCC_APB1ENR_TIM12EN  		0x00000040	//
#define	RCC_APB1ENR_TIM13EN  		0x00000080	//
#define	RCC_APB1ENR_TIM14EN  		0x00000100	//
#define	RCC_APB1ENR_LPTIM1EN 		0x00000200	//
#define	RCC_APB1ENR_WWDGEN   		0x00000800	//
#define	RCC_APB1ENR_SPI2EN   		0x00004000	//
#define	RCC_APB1ENR_SPI3EN   		0x00008000	//
#define	RCC_APB1ENR_SPDIFRXEN		0x00010000	//
#define	RCC_APB1ENR_USART2EN 		0x00020000	//
#define	RCC_APB1ENR_USART3EN 		0x00040000	//
#define	RCC_APB1ENR_UART4EN  		0x00080000	//
#define	RCC_APB1ENR_UART5EN  		0x00100000	//
#define	RCC_APB1ENR_I2C1EN   		0x00200000	//
#define	RCC_APB1ENR_I2C2EN   		0x00400000	//
#define	RCC_APB1ENR_I2C3EN   		0x00800000	//
#define	RCC_APB1ENR_I2C4EN   		0x01000000	//
#define	RCC_APB1ENR_CAN1EN   		0x02000000	//
#define	RCC_APB1ENR_CAN2EN   		0x04000000	//
#define	RCC_APB1ENR_CECEN    		0x08000000	//
#define	RCC_APB1ENR_PWREN    		0x10000000	//
#define	RCC_APB1ENR_DACEN    		0x20000000	//
#define	RCC_APB1ENR_UART7EN  		0x40000000	//
#define	RCC_APB1ENR_UART8EN  		0x80000000	//

